---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewUpdateSurfaces
source: html/0ff3e1e6-9ab3-2667-168a-754fada57cf0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewUpdateSurfaces Property

"Update Surfaces"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisViewUpdateSurfaces { get; }
```